'''
HSV色空間を使って、青色の領域だけを抽出する
  : cv2.cvtColor()
  : cv2.inRange()
  : cv2.findContours()

処理の流れ
  1. テスト用のカラー画像を作る
  2. BGR画像をHSV画像へ変換する
  3. HSVで「青色」の範囲を指定する
  4. cv2.inRange() で青色だけを白にした二値画像を作る
  5. 青色領域の輪郭を検出する
  6. 青色物体を長方形で囲む

テスト画像
  赤い四角形
  緑の円
  青い四角形
  黄色の円
'''

import cv2
import numpy as  np

# -------------------------------------------------------------------
# テスト画像を作成
# -------------------------------------------------------------------
image = np.ones(
    (600, 800, 3),
    dtype = np.uint8
) * 255

# 赤い四角
cv2.rectangle(image,
              (50, 50),
              (300, 200),
              (0, 0, 255),
              -1
)

# 緑の円
cv2.circle(image,
           (550, 150),
           100,
           (0,255,0),
           -1
)

# 青い四角形
cv2.rectangle(image,
              (80, 350),
              (350, 520),
              (255,0,0),
              -1
)

# 黄色の円
cv2.circle(image,
           (600, 420),
           100,
           (0, 255,255),
           -1
)

# -------------------------------------------------------------------
# BGR → HSV
# -------------------------------------------------------------------
hsv = cv2.cvtColor(
    image,
    cv2.COLOR_BGR2HSV
)
# -------------------------------------------------------------------
# 青色の範囲を指定
#
# OpenCVのHSV
#   H : 0～179
#   S : 0～255
#   V : 0～255
# -------------------------------------------------------------------
lower_bule = np.array([100, 100, 100])
upper_bule = np.array([140, 255, 255])

# -------------------------------------------------------------------
# 青色だけを抽出
#
# 範囲内  → 255（白）
# 範囲外  →   0（黒）
# -------------------------------------------------------------------
mask = cv2.inRange(hsv, lower_bule, upper_bule)

# -------------------------------------------------------------------
# 青色領域の輪郭を検出
# -------------------------------------------------------------------
contours, hierarchy = cv2.findContours(mask, cv2.RETR_EXTERNAL, cv2.CHAIN_APPROX_SIMPLE)

print("青色領域の輪郭数 :", len(contours))

#描画用画像
result = image.copy()

# -------------------------------------------------------------------
# 検出した青色物体を囲む
# -------------------------------------------------------------------
# この面積未満の輪郭は除外する
MIN_AREA = 500

# 各輪郭の面積を求める
for i, contour in enumerate(contours):
    # 輪郭の面積を求める
    area = cv2.contourArea(contour)

    if area < MIN_AREA:
        # 面積が一定以下の輪郭は除外する
        continue

    x, y, w, h = cv2.boundingRect(contour)
    print(
        f"輪郭[{i:3d}]"
        f"(area={area:9.1f}) "
        f"x={x:4d} y={x:4d} "
        f"w={w:4d} h={h:4d} "
    )

    cv2.rectangle(result, (x, y), (x+w, y+h), (0,0,0), 3)

#-------------------------------------------------------------------
# 画像表示
#-------------------------------------------------------------------
cv2.imshow("Original Image", image)
cv2.imshow("HSV", hsv)
cv2.imshow("Blue Mask", mask)
cv2.imshow("result",result)

cv2.waitKey(0)
cv2.destroyAllWindows()