'''
HSVマスクで青色領域を抽出し、輪郭・位置・大きさを取得する
  : cv2.cvtColor()
  : cv2.inRange()
  : cv2.bitwise_and()
  : cv2.findContours()
  : cv2.boundingRect()

処理の流れ
  1. テスト用のカラー画像を作る
  2. BGR画像をHSV画像へ変換する
  3. 青色のHSV範囲を指定する
  4. inRange() で青色領域のマスクを作る
  5. bitwise_and() で青色部分だけをカラーで抽出する
  6. mask画像から輪郭を検出する
  7. 青色領域を外接長方形で囲む
  8. 青色領域の位置と大きさを表示する
'''

import cv2
import numpy as  np

# -------------------------------------------------------------------
# テスト画像を作成
# -------------------------------------------------------------------
image = np.ones(
    (600, 800, 3),
    dtype = np.uint8
) * 255

# 赤い四角
cv2.rectangle(image,
              (50, 50),
              (300, 200),
              (0, 0, 255),
              -1
)

# 緑の円
cv2.circle(image,
           (550, 150),
           100,
           (0,255,0),
           -1
)

# 青い四角形
cv2.rectangle(image,
              (80, 350),
              (350, 520),
              (255,0,0),
              -1
)

# 黄色の円
cv2.circle(image,
           (600, 420),
           100,
           (0, 255,255),
           -1
)

# -------------------------------------------------------------------
# BGR → HSV
# -------------------------------------------------------------------
hsv = cv2.cvtColor(
    image,
    cv2.COLOR_BGR2HSV
)
# -------------------------------------------------------------------
# 青色の範囲を指定
#
# OpenCVのHSV
#   H : 0～179
#   S : 0～255
#   V : 0～255
# -------------------------------------------------------------------
lower_bule = np.array([100, 100, 100])
upper_bule = np.array([140, 255, 255])

# -------------------------------------------------------------------
# 青色マスクを作成
#
# 範囲内  → 255（白）
# 範囲外  →   0（黒）
# -------------------------------------------------------------------
mask = cv2.inRange(hsv, lower_bule, upper_bule)

#-------------------------------------------------------------------
# マスクを使って青色部分だけ抽出
#-------------------------------------------------------------------
blue_only = cv2.bitwise_and(image, image, mask=mask)

#-------------------------------------------------------------------
# mask画像から輪郭を検出
# maskはすでに
#    青色領域 = 白
#    それ以外 = 黒
# になっているので、そのままfindContours()に渡せる
#-------------------------------------------------------------------
contours, hierarchy = cv2.findContours(mask, cv2.RETR_EXTERNAL, cv2.CHAIN_APPROX_SIMPLE)

print("青色領域の輪郭数 :", len(contours))


#-------------------------------------------------------------------
# 検出結果描画用
#-------------------------------------------------------------------
result = image.copy()

#-------------------------------------------------------------------
# 輪郭ごとに位置と大きさを取得
#-------------------------------------------------------------------
for i, contour in enumerate(contours):
  area = cv2.contourArea(contour) # 輪郭の面積を取得する
  if area < 500:
      continue

  x, y, w, h = cv2.boundingRect(contour)
  center_x = x + w // 2
  center_y = y + h // 2
    
  print(
      f"輪郭[{i:4d}] "
      f"area={area:9.1f} "
      f"x={x:4d}, y={y:4d} "
      f"w={w:4d}, h={h:4d} "
      f"center=({center_x:4d}, {center_y:4d})"
  )

  # 外接長方形を描画
  cv2.rectangle(result, (x, y), (x+w, y+h), (0,0,0), 3)

  # 中心を描画
  cv2.circle(result, (center_x, center_y), 6, (0,0,255), -1)

#-------------------------------------------------------------------
# 画像表示
#-------------------------------------------------------------------
cv2.imshow("Original Image", image)
cv2.imshow("Blue Mask", mask)
cv2.imshow("Blue only",blue_only)
cv2.imshow("Detection Result", result)

cv2.waitKey(0)
cv2.destroyAllWindows()