'''
HSVマスクを使って、青色部分だけをカラー画像として抽出する
  : cv2.inRange()
  : cv2.bitwise_and()

処理の流れ
  1. テスト用のカラー画像を作る
  2. BGR画像をHSV画像へ変換する
  3. 青色のHSV範囲を指定する
  4. inRange() で青色だけ白になるマスクを作る
  5. bitwise_and() で元画像から青色部分だけを残す
  6. 元画像・マスク・抽出結果を表示する
'''

import cv2
import numpy as  np

# -------------------------------------------------------------------
# テスト画像を作成
# -------------------------------------------------------------------
image = np.ones(
    (600, 800, 3),
    dtype = np.uint8
) * 255

# 赤い四角
cv2.rectangle(image,
              (50, 50),
              (300, 200),
              (0, 0, 255),
              -1
)

# 緑の円
cv2.circle(image,
           (550, 150),
           100,
           (0,255,0),
           -1
)

# 青い四角形
cv2.rectangle(image,
              (80, 350),
              (350, 520),
              (255,0,0),
              -1
)

# 黄色の円
cv2.circle(image,
           (600, 420),
           100,
           (0, 255,255),
           -1
)

# -------------------------------------------------------------------
# BGR → HSV
# -------------------------------------------------------------------
hsv = cv2.cvtColor(
    image,
    cv2.COLOR_BGR2HSV
)
# -------------------------------------------------------------------
# 青色の範囲を指定
#
# OpenCVのHSV
#   H : 0～179
#   S : 0～255
#   V : 0～255
# -------------------------------------------------------------------
lower_bule = np.array([100, 100, 100])
upper_bule = np.array([140, 255, 255])

# -------------------------------------------------------------------
# 青色マスクを作成
#
# 範囲内  → 255（白）
# 範囲外  →   0（黒）
# -------------------------------------------------------------------
mask = cv2.inRange(hsv, lower_bule, upper_bule)

#-------------------------------------------------------------------
# マスクを使って青色部分だけ抽出
#-------------------------------------------------------------------
blue_only = cv2.bitwise_and(image, image, mask=mask)

#-------------------------------------------------------------------
# 画像表示
#-------------------------------------------------------------------
cv2.imshow("Original Image", image)
cv2.imshow("Blue Mask", mask)
cv2.imshow("Blue only",blue_only)

cv2.waitKey(0)
cv2.destroyAllWindows()